Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_0944.txt
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 81.410ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 214.407ms, rate sampling interval: 896ms
  Thread calibration: mean lat.: 80.414ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 139.273ms, rate sampling interval: 1292ms
  Thread calibration: mean lat.: 93.411ms, rate sampling interval: 145ms
  Thread calibration: mean lat.: 53.412ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 69.209ms, rate sampling interval: 98ms
  Thread calibration: mean lat.: 551.034ms, rate sampling interval: 4141ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   255.52ms  240.80ms   1.08s    56.45%
    Req/Sec     5.92     11.86    50.00     86.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  234.24ms
 75.000%  399.10ms
 90.000%  509.70ms
 99.000%    1.08s 
 99.900%    1.62s 
 99.990%    2.08s 
 99.999%    2.70s 
100.000%    2.78s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.451     0.000000            1         1.00
      10.399     0.100000         5694         1.11
      12.815     0.200000        11387         1.25
     149.247     0.300000        17472         1.43
     150.783     0.400000        22955         1.67
     234.239     0.500000        28459         2.00
     235.519     0.550000        31343         2.22
     236.415     0.600000        34478         2.50
     237.439     0.650000        37000         2.86
     262.655     0.700000        39823         3.33
     399.103     0.750000        42674         4.00
     401.407     0.775000        44198         4.44
     505.599     0.800000        45624         5.00
     506.879     0.825000        47346         5.71
     507.391     0.850000        48386         6.67
     508.159     0.875000        49833         8.00
     508.671     0.887500        50516         8.89
     509.695     0.900000        51301        10.00
     522.495     0.912500        51916        11.43
     582.655     0.925000        52626        13.33
     649.727     0.937500        53342        16.00
     674.815     0.943750        53690        17.78
     703.487     0.950000        54051        20.00
     738.815     0.956250        54405        22.86
     781.311     0.962500        54759        26.67
     834.559     0.968750        55118        32.00
     863.231     0.971875        55291        35.56
     891.391     0.975000        55470        40.00
     920.063     0.978125        55647        45.71
     952.319     0.981250        55825        53.33
     982.527     0.984375        56004        64.00
     997.887     0.985938        56094        71.11
    1018.367     0.987500        56181        80.00
    1054.719     0.989062        56270        91.43
    1094.655     0.990625        56358       106.67
    1142.783     0.992188        56447       128.00
    1165.311     0.992969        56490       142.22
    1202.175     0.993750        56537       160.00
    1231.871     0.994531        56581       182.86
    1270.783     0.995313        56624       213.33
    1312.767     0.996094        56669       256.00
    1329.151     0.996484        56690       284.44
    1359.871     0.996875        56714       320.00
    1390.591     0.997266        56735       365.71
    1428.479     0.997656        56757       426.67
    1469.439     0.998047        56779       512.00
    1491.967     0.998242        56791       568.89
    1524.735     0.998437        56802       640.00
    1553.407     0.998633        56813       731.43
    1590.271     0.998828        56824       853.33
    1619.967     0.999023        56835      1024.00
    1629.183     0.999121        56841      1137.78
    1660.927     0.999219        56846      1280.00
    1694.719     0.999316        56852      1462.86
    1707.007     0.999414        56857      1706.67
    1755.135     0.999512        56863      2048.00
    1785.855     0.999561        56865      2275.56
    1809.407     0.999609        56868      2560.00
    1823.743     0.999658        56871      2925.71
    1896.447     0.999707        56874      3413.33
    1925.119     0.999756        56877      4096.00
    1946.623     0.999780        56878      4551.11
    1967.103     0.999805        56879      5120.00
    1979.391     0.999829        56881      5851.43
    2012.159     0.999854        56882      6826.67
    2075.647     0.999878        56884      8192.00
    2075.647     0.999890        56884      9102.22
    2101.247     0.999902        56885     10240.00
    2154.495     0.999915        56886     11702.86
    2154.495     0.999927        56886     13653.33
    2295.807     0.999939        56887     16384.00
    2295.807     0.999945        56887     18204.44
    2455.551     0.999951        56888     20480.00
    2455.551     0.999957        56888     23405.71
    2455.551     0.999963        56888     27306.67
    2699.263     0.999969        56889     32768.00
    2699.263     0.999973        56889     36408.89
    2699.263     0.999976        56889     40960.00
    2699.263     0.999979        56889     46811.43
    2699.263     0.999982        56889     54613.33
    2775.039     0.999985        56890     65536.00
    2775.039     1.000000        56890          inf
#[Mean    =      255.518, StdDeviation   =      240.802]
#[Max     =     2772.992, Total count    =        56890]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57415 requests in 20.00m, 16.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 21228
  Non-2xx or 3xx responses: 19
Requests/sec:     47.84  
Transfer/sec:     14.05KB