Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_1010.txt
Running 20m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 183.856ms, rate sampling interval: 746ms
  Thread calibration: mean lat.: 295.240ms, rate sampling interval: 2420ms
  Thread calibration: mean lat.: 44.935ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 78.131ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 44.422ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 263.279ms, rate sampling interval: 715ms
  Thread calibration: mean lat.: 65.297ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 137.567ms, rate sampling interval: 953ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    97.58ms  124.18ms 614.40ms   92.35%
    Req/Sec     6.02     14.09    66.00     84.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   57.12ms
 75.000%  149.63ms
 90.000%  163.71ms
 99.000%  614.40ms
 99.900%    1.10s 
 99.990%    1.78s 
 99.999%    2.10s 
100.000%    2.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.427     0.000000            1         1.00
      10.295     0.100000         5709         1.11
      12.799     0.200000        11394         1.25
      41.727     0.300000        17158         1.43
      44.031     0.400000        22801         1.67
      57.119     0.500000        28478         2.00
      57.791     0.550000        31398         2.22
      58.655     0.600000        34152         2.50
      61.983     0.650000        36988         2.86
     148.735     0.700000        40040         3.33
     149.631     0.750000        42837         4.00
     150.015     0.775000        44243         4.44
     150.399     0.800000        45641         5.00
     150.911     0.825000        47293         5.71
     151.423     0.850000        48569         6.67
     152.191     0.875000        49798         8.00
     153.215     0.887500        50538         8.89
     163.711     0.900000        51214        10.00
     193.151     0.912500        51925        11.43
     233.471     0.925000        52634        13.33
     342.527     0.937500        53345        16.00
     398.591     0.943750        53818        17.78
     399.103     0.950000        54159        20.00
     399.615     0.956250        54573        22.86
     400.127     0.962500        54899        26.67
     400.639     0.968750        55160        32.00
     401.151     0.971875        55368        35.56
     401.663     0.975000        55492        40.00
     404.991     0.978125        55656        45.71
     441.087     0.981250        55835        53.33
     502.271     0.984375        56011        64.00
     539.135     0.985938        56101        71.11
     560.127     0.987500        56189        80.00
     601.599     0.989062        56278        91.43
     628.223     0.990625        56367       106.67
     668.671     0.992188        56460       128.00
     688.127     0.992969        56500       142.22
     708.095     0.993750        56545       160.00
     730.111     0.994531        56589       182.86
     755.711     0.995313        56634       213.33
     781.311     0.996094        56678       256.00
     796.159     0.996484        56701       284.44
     818.687     0.996875        56723       320.00
     845.311     0.997266        56745       365.71
     888.319     0.997656        56767       426.67
     941.567     0.998047        56789       512.00
     962.047     0.998242        56800       568.89
    1001.471     0.998437        56812       640.00
    1033.215     0.998633        56823       731.43
    1073.151     0.998828        56834       853.33
    1101.823     0.999023        56845      1024.00
    1124.351     0.999121        56850      1137.78
    1144.831     0.999219        56856      1280.00
    1153.023     0.999316        56862      1462.86
    1187.839     0.999414        56867      1706.67
    1238.015     0.999512        56873      2048.00
    1273.855     0.999561        56875      2275.56
    1327.103     0.999609        56878      2560.00
    1357.823     0.999658        56881      2925.71
    1422.335     0.999707        56884      3413.33
    1504.255     0.999756        56887      4096.00
    1550.335     0.999780        56888      4551.11
    1588.223     0.999805        56889      5120.00
    1737.727     0.999829        56891      5851.43
    1771.519     0.999854        56892      6826.67
    1783.807     0.999878        56894      8192.00
    1783.807     0.999890        56894      9102.22
    1825.791     0.999902        56895     10240.00
    2021.375     0.999915        56896     11702.86
    2021.375     0.999927        56896     13653.33
    2051.071     0.999939        56897     16384.00
    2051.071     0.999945        56897     18204.44
    2071.551     0.999951        56898     20480.00
    2071.551     0.999957        56898     23405.71
    2071.551     0.999963        56898     27306.67
    2099.199     0.999969        56899     32768.00
    2099.199     0.999973        56899     36408.89
    2099.199     0.999976        56899     40960.00
    2099.199     0.999979        56899     46811.43
    2099.199     0.999982        56899     54613.33
    2203.647     0.999985        56900     65536.00
    2203.647     1.000000        56900          inf
#[Mean    =       97.582, StdDeviation   =      124.177]
#[Max     =     2201.600, Total count    =        56900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57429 requests in 20.00m, 16.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 21203
  Non-2xx or 3xx responses: 24
Requests/sec:     47.85  
Transfer/sec:     14.03KB